Перем Счетчик;

Процедура ДеревоОбъектовВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если Колонка.Имя="ОткрытьВПроводнике" Тогда
		Файл=Новый Файл(ВыбраннаяСтрока.ПолноеИмя);
		ОткрытьВПроводнике(Файл);
	ИначеЕсли   Колонка.Имя="ОткрытьВБлокноте" и ВыбраннаяСтрока.ИндексКартинки<>1  тогда
			WS=Новый COMОбъект("WScript.Shell");
			WS.Run("Notepad "+ВыбраннаяСтрока.ПолноеИмя,10);
	ИначеЕсли ВыбраннаяСтрока.ИндексКартинки<>1 тогда
		Текст = Новый ТекстовыйДокумент;
		Текст.Прочитать(ВыбраннаяСтрока.ПолноеИмя, КодировкаТекста.UTF8);
		Этаформа.ВладелецФормы.ЭлементыФормы.ПолеТекстовогоДокумента1.УстановитьТекст(Текст.ПолучитьТекст());
	Иначе 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДеревоОбъектовПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	ОформлениеСтроки.Ячейки.Имя.ОтображатьКартинку=истина;
	ОформлениеСтроки.Ячейки.Имя.ИндексКартинки=ДанныеСтроки.ИндексКартинки;
	Если ДанныеСтроки.ИндексКартинки=1 Тогда
		ОформлениеСтроки.Ячейки.ОткрытьВБлокноте.ОтображатьКартинку=ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДеревоОбъектовПриАктивизацииСтроки(Элемент)
	Если Элемент=Элементыформы.ДеревоОбъектов тогда
		Дерево=Этаформа.ВладелецФормы.ДеревоМетаданных;
		Гиперссылка=ЭлементыФормы.ОбъектМетаданных
	ИначеЕсли Элемент=Элементыформы.ДеревоОбъектов1 тогда
		Дерево=Этаформа.ВладелецФормы.ДеревоCf;
		Гиперссылка=ЭлементыФормы.ОбъектМетаданных1;
	Иначе
		Дерево=ЭтаФорма.ВладелецФормы.ТретьеДерево;
		Гиперссылка=ЭлементыФормы.ОбъектМетаданных2;
	Конецесли;
	Если Открытие=ложь тогда
		Если Элемент.ТекущаяСтрока<>Неопределено тогда
			Если  Элемент.ТекущаяСтрока.Родитель=Неопределено  тогда 
				СтрокаОбъекта=Дерево.Строки.Найти(Элемент.ТекущаяСтрока.Имя, "ПутьТекОбъект", истина);
				Если СтрокаОбъекта<>Неопределено Тогда
					Гиперссылка.Заголовок=СтрокаОбъекта.Синоним;
					Гиперссылка.Гиперссылка=истина;
				Иначе 	Гиперссылка.Заголовок="Объект не найден";
					Гиперссылка.Гиперссылка=ложь;
				КонецЕсли;
			Иначе СтрокаОбъекта=Дерево.Строки.Найти(Элемент.ТекущаяСтрока.Родитель.Имя, "ПутьТекОбъект", истина);
				Если СтрокаОбъекта<>Неопределено Тогда
					Гиперссылка.Заголовок=СтрокаОбъекта.Синоним;
					Гиперссылка.Гиперссылка=истина;
				Иначе 	Гиперссылка.Заголовок="Объект не найден";
					Гиперссылка.Гиперссылка=ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе 
		Если РежимСравнения=1 и Счетчик=Неопределено тогда
			Счетчик=1;
		Иначе 
			Открытие=ложь;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбъектМетаданныхНажатие(Элемент)
	Если Элемент=ЭлементыФормы.ОбъектМетаданных тогда
		Если РежимСравнения=1 тогда
			ЭтаФорма.ВладелецФормы.ЭлементыФормы.ПанельДляДерева.ТекущаяСтраница=ЭтаФорма.ВладелецФормы.ЭлементыФормы.ПанельДляДерева.Страницы.ДеревоCfu;
		КонецЕсли;
		ЭтаФорма.ВладелецФормы.ЭлементыФормы.ДеревоМетаданных.ТекущаяСтрока=ЭтаФорма.ВладелецФормы.ЭлементыФормы.ДеревоМетаданных.Значение.Строки.Найти(Элемент.Заголовок,"Синоним",Истина);	
	Иначе  			
		ЭтаФорма.ВладелецФормы.ЭлементыФормы.ПанельДляДерева.ТекущаяСтраница=ЭтаФорма.ВладелецФормы.ЭлементыФормы.ПанельДляДерева.Страницы.ДеревоCf;
		ЭтаФорма.ВладелецФормы.ЭлементыФормы.ДеревоCf.ТекущаяСтрока=ЭтаФорма.ВладелецФормы.ЭлементыФормы.ДеревоCf.Значение.Строки.Найти(Элемент.Заголовок,"Синоним",Истина);	
	Конецесли;
КонецПроцедуры

Процедура КонтекстноеМенюСортироватьПоВыделенному(Кнопка)
	ИмяТекКолонки=ЭтаФорма.ТекущийЭлемент.ТекущаяКолонка.Имя;
	ЭтаФорма.ТекущийЭлемент.Значение.Строки.Сортировать(""+ИмяТекКолонки+" возр",Истина);
КонецПроцедуры

Процедура КонтекстноеМенюСортироватьПоВыделенному1(Кнопка)
	ИмяТекКолонки=ЭтаФорма.ТекущийЭлемент.ТекущаяКолонка.Имя;
	ЭтаФорма.ТекущийЭлемент.Значение.Строки.Сортировать(""+ИмяТекКолонки+" убыв",Истина);
КонецПроцедуры

Процедура КонтекстноеМенюВосстановитьПоУмолчанию(Кнопка)
	ЭтаФорма.ТекущийЭлемент.Значение.Строки.Сортировать("ИндексКартинки убыв, Имя возр");
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ВладелецФормы.ЭлементыФормы.УправляющаяКоманднаяПанель.Кнопки.ОткрытьНавигаторФайлов.Доступность=Истина;
КонецПроцедуры
