
//из публикации MRAK http://infostart.ru/public/22147/
Процедура ПриОткрытии()
	Выполнить(ТекстФормы);
КонецПроцедуры

//предложенная Istur в публикации http://infostart.ru/public/99363/ процедура для присвоения элементу нужного положения
Процедура УстановитьПоложениеЭлемента(Элемент,Верх,Высота,Лево,Ширина)
	Элемент.Верх = Верх;
	Если Тип(Элемент)<>Тип("КоманднаяПанель") тогда
		Элемент.Высота = Высота;
	Конецесли;
	Элемент.Лево = Лево;
	Элемент.Ширина = Ширина;
КонецПроцедуры

//фиктивная функция обработки действия - для видимой доступности кнопок
Процедура ОбработчикНажатияКнопки()
	
КонецПроцедуры

//назначение форме владельца (чтобы можно было открыть несколько форм рядом и все они были подчиненными одной форме-владельцу)
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ВладелецФормы=Ключ;
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца=Истина;
КонецПроцедуры

