

Процедура РазличияДействийВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	СравнениеПроцедур = ТекстовоеСравнениеВоВременныхФайлах(ВыбраннаяСтрока.ТекстПервогоЭлемента,ВыбраннаяСтрока.ТекстВторогоЭлемента);
	СравнениеПроцедур.ПоказатьРазличия();
КонецПроцедуры

Процедура ДействияЭлементаВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	ТекстОбработчика = Новый ТекстовыйДокумент;
	ТекстОбработчика.УстановитьТекст(ВыбраннаяСтрока.ТекстСвойства);
	ТекстОбработчика.Показать();
КонецПроцедуры

Процедура ТабличноеПолеСвойствВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если Лев(ВыбраннаяСтрока.Значение,6)="<elem>" Тогда
		ТекстСвойства = Новый ТекстовыйДокумент;
		ТекстСвойства.УстановитьТекст(ВыбраннаяСтрока.Значение);
		ТекстСвойства.Показать();
	КонецЕсли;
КонецПроцедуры

Процедура РазличияСвойствВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если Лев(ВыбраннаяСтрока.ЗначениеПервойФормы,6)="<elem>" Тогда
		СравнениеСвойств = ТекстовоеСравнениеВоВременныхФайлах(ВыбраннаяСтрока.ЗначениеПервойФормы,ВыбраннаяСтрока.ЗначениеВторойФормы);
		СравнениеСвойств.ПоказатьРазличия();
	КонецЕсли;
КонецПроцедуры

