
Процедура ВыгрузитьВФайлНажатие(Элемент)
		ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогВыбора.Заголовок="Сохранить как...";
		ДиалогВыбора.Фильтр="Все файлы (*.*)";
		ДиалогВыбора.ПолноеИмяФайла=ИмяФайла;
	Если ДиалогВыбора.Выбрать() Тогда
		ИмяФайлаРезультата = ДиалогВыбора.ПолноеИмяФайла;
		Реквизит.Записать(ИмяФайлаРезультата);
		ЭтаФорма.Закрыть();
		Предупреждение("Файл сохранен!",10);
	КонецЕсли;
// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ОтменаНажатие(Элемент)
		Закрыть();
КонецПроцедуры
