
Процедура ПриОткрытии()
	Картинка=Новый картинка(Реквизит,Истина);
	ЭтаФорма.ЭлементыФормы.ФорматКартинки.Заголовок="Тип картинки: "+Картинка.Формат();
	Этаформа.ЭлементыФормы.ПолеКартинки1.Картинка=Картинка;
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура СохранитьВФайл(Кнопка)
	Рисунок=ЭтаФорма.ЭлементыФормы.ПолеКартинки1.Картинка;
	Если Элементыформы.ПолеКартинки1.Картинка.Формат()=ФорматКартинки.BMP Тогда Фильтр="BMP (*.bmp)|*.bmp"
	ИначеЕсли Элементыформы.ПолеКартинки1.Картинка.Формат()=ФорматКартинки.JPEG Тогда фильтр="JPEG (*.jpg)|*.jpg"
	ИначеЕсли Элементыформы.ПолеКартинки1.Картинка.Формат()=ФорматКартинки.Icon Тогда Фильтр="ICO (*.ico)|*.ico"
	ИначеЕсли Элементыформы.ПолеКартинки1.Картинка.Формат()=ФорматКартинки.PNG Тогда фильтр="PNG (*.png)|*.png"
	ИначеЕсли Элементыформы.ПолеКартинки1.Картинка.Формат()=ФорматКартинки.GIF Тогда Фильтр="GIF (*.gif)|*.gif"
	ИначеЕсли Элементыформы.ПолеКартинки1.Картинка.Формат()=ФорматКартинки.TIFF Тогда фильтр="TIFF (*.tif)|*.tif"
	Иначе Фильтр=""
		КонецЕсли;
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогВыбора.Фильтр=Фильтр;
		ДиалогВыбора.Заголовок="Сохранить как...";
	Если ДиалогВыбора.Выбрать() Тогда
		ИмяФайлаРезультата = ДиалогВыбора.ПолноеИмяФайла;
		ЭлементыФормы.ПолеКартинки1.Картинка.Записать(ИмяФайлаРезультата);
	КонецЕсли;

	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриЗакрытии()
		Для д=0 по КоллекцияВременныхФайлов.Количество()-1 цикл
		УдалитьФайлы(КоллекцияВременныхФайлов[д].ПолноеИмя);
	КонецЦикла;
	  КоллекцияВременныхФайлов.Очистить();
КонецПроцедуры

