//_________________________________________
//
// Copyright © Андрей Михайлов aka MAV
// Адрес для связи: mav@erpg.ru
// Мой сайт в интернет: www.erpg.ru
// ICQ: 137167406
//_________________________________________

Перем Документ;
Перем Адрес;
Перем ПредыдущийРежим;

//Процедура ВыполнитьКомандуМеню(Элемент)
//	ОбАвторе(Элемент);
//КонецПроцедуры

Процедура ЗагрузитьДокумент(Адрес)
	ЭлементыФормы.ПолеHTMLДокумента.Перейти(Адрес);
КонецПроцедуры

Процедура ПриОткрытии()
	// Заполнение списка стилей
	//СтилиТекста = ЭлементыФормы.КомандаformatBlock.СписокВыбора;
	//СтилиТекста.Добавить("<p>", "Обычный");
	//СтилиТекста.Добавить("<h1>", "Заголовок 1");
	//СтилиТекста.Добавить("<h2>", "Заголовок 2");
	//СтилиТекста.Добавить("<h3>", "Заголовок 3");
	//СтилиТекста.Добавить("<h4>", "Заголовок 4");
	//СтилиТекста.Добавить("<h5>", "Заголовок 5");
	//СтилиТекста.Добавить("<h6>", "Заголовок 6");
	//СтилиТекста.Добавить("<pre>", "Форматированный");
	//СтилиТекста.Добавить("<address>", "Адрес");
	//ЭлементыФормы.КомандаformatBlock.Значение = СтилиТекста[0].Значение;
	
	// Заполнение списка шрифтов
	//Список = ЭлементыФормы.КомандаFontName.СписокВыбора;
	//Список.Добавить("Arial");
	//Список.Добавить("Arial Black");
	//Список.Добавить("Arial Narrow");
	//Список.Добавить("Comic Sans MS");
	//Список.Добавить("Courier New");
	//Список.Добавить("System");
	//Список.Добавить("Tahoma");
	//Список.Добавить("Times New Roman");
	//Список.Добавить("Verdana");
	//Список.Добавить("Wingdings");
	//ЭлементыФормы.КомандаFontName.Значение = Список[0].Значение;
	//
	//// Заполнение списка размеров
	//Список = ЭлементыФормы.КомандаFontSize.СписокВыбора;
	//Для Ном = 1 По 14 Цикл
	//	Список.Добавить(Ном);
	//КонецЦикла;
	//ЭлементыФормы.КомандаFontSize.Значение = Список[2].Значение;
	
	Документ=ЭлементыФормы.ПолеHTMLДокумента.Документ;
	ПредыдущийРежим = ЭлементыФормы.КоманднаяПанель.Кнопки.Редактирование;
КонецПроцедуры

Процедура КоманднаяПанельРежим(Кнопка)
	Если Кнопка.Пометка Тогда
		Возврат;
	КонецЕсли; 
	
	ЭлементыФормы.КоманднаяПанель.Кнопки.Редактирование.Пометка = Ложь;
	ЭлементыФормы.КоманднаяПанель.Кнопки.Текст.Пометка = Ложь;
	ЭлементыФормы.КоманднаяПанель.Кнопки.Просмотр.Пометка = Ложь;
	Кнопка.Пометка = Истина;
	
	
	Если Кнопка = ЭлементыФормы.КоманднаяПанель.Кнопки.Текст Тогда
		//Документ.Body.InnerText = Документ.Body.InnerHTML;
		
		sExpression = "
		|document.body.innerText = document.body.innerHTML;
		|document.body.innerHTML = colourCode(document.body.innerHTML);
		|function colourCode(code)
		|{
		|    htmlTag = /(&lt;([\s\S]*?)&gt;)/gi
		|    tableTag = /(&lt;(table|tbody|th|tr|td|\/table|\/tbody|\/th|\/tr|\/td)([\s\S]*?)&gt;)/gi
		|    commentTag = /(&lt;!--([\s\S]*?)&gt;)/gi
		|    imageTag = /(&lt;img([\s\S]*?)&gt;)/gi
		|    linkTag = /(&lt;(a|\/a)([\s\S]*?)&gt;)/gi
		|    scriptTag = /(&lt;(script|\/script)([\s\S]*?)&gt;)/gi
		|    code = code.replace(htmlTag,""<font color=#FF0000>$1</font>"")
		|    code = code.replace(tableTag,""<font color=#008080>$1</font>"")
		|    code = code.replace(commentTag,""<font color=#808080>$1</font>"")
		|    code = code.replace(imageTag,""<font color=#800080>$1</font>"")
		|    code = code.replace(linkTag,""<font color=#008000>$1</font>"")
		|    code = code.replace(scriptTag,""<font color=#800000>$1</font>"")
		|    return code;
		|}";
		Документ.parentWindow.execScript(sExpression);

	ИначеЕсли ПредыдущийРежим = ЭлементыФормы.КоманднаяПанель.Кнопки.Текст Тогда
		Документ.Body.InnerHTML = Документ.Body.InnerText;
		
	КонецЕсли;
	
	Если Кнопка = ЭлементыФормы.КоманднаяПанель.Кнопки.Просмотр Тогда
		Документ.Body.ContentEditable = "false";
		
	Иначе
		Документ.Body.ContentEditable = "true";
		
	КонецЕсли;

	Доступность = (Кнопка = ЭлементыФормы.КоманднаяПанель.Кнопки.Редактирование);
	//ЭлементыФормы.КомандаFormatBlock.Доступность = Доступность;
	//ЭлементыФормы.КомандаFontName.Доступность = Доступность;
	//ЭлементыФормы.КомандаFontSize.Доступность = Доступность;

	УправлятьДоступностью = Ложь;
	Для каждого Кн Из ЭлементыФормы.КоманднаяПанель.Кнопки Цикл
		Если УправлятьДоступностью Тогда
			Кн.Доступность = Доступность
		КонецЕсли; 
		Если Кн.Имя = "РазделительОсновной" Тогда
			УправлятьДоступностью = Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	ПредыдущийРежим = Кнопка;
	ПоказатьРежимыКнопок();
КонецПроцедуры

Процедура ВыполнитьКоманду(Кнопка)
	Команда = Сред(Кнопка.Имя, 8);
	
	Если (Кнопка = ЭлементыФормы.КоманднаяПанель.Кнопки.КомандаSaveAs) или 
		 (Кнопка = ЭлементыФормы.КоманднаяПанель.Кнопки.КомандаPrint) Тогда
		КоманднаяПанельРежим(ЭлементыФормы.КоманднаяПанель.Кнопки.Редактирование);
	КонецЕсли; 
	
	Если Документ.queryCommandSupported(Команда) Тогда
		Если ТипЗнч(Кнопка) = Тип("ПолеВыбора") Тогда
			Документ.execCommand(Команда, Истина, Кнопка.Значение);
		Иначе
			Документ.execCommand(Команда, Ложь);
		КонецЕсли; 
		ПоказатьРежимыКнопок();
	КонецЕсли;
КонецПроцедуры

Процедура КоманднаяПанельОткрыть(Кнопка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.ПолноеИмяФайла = Адрес;
	Диалог.Заголовок = "Выберите html-файл";
	Диалог.Фильтр = "HTML файлы|*.htm*|Все файлы|*.*";
	Диалог.Расширение = "htm";

	Если Диалог.Выбрать() Тогда
		Адрес = Диалог.ПолноеИмяФайла;
		ЗагрузитьДокумент(Диалог.ПолноеИмяФайла);
	КонецЕсли;
КонецПроцедуры

Процедура ВыборЦвета(Кнопка)
	Цвет = ЭтотОбъект.ПолучитьФорму("ВыборЦвета").ОткрытьМодально();
	Если Цвет <> Неопределено Тогда
		Команда = Сред(Кнопка.Имя, 8);
		Если Документ.queryCommandSupported(Команда) Тогда
			Документ.execCommand(Команда, Ложь, "" + ПеревестиИз10(Цвет.Красный) + ПеревестиИз10(Цвет.Зеленый) + ПеревестиИз10(Цвет.Синий));
		КонецЕсли;
	КонецЕсли;
	ПоказатьРежимыКнопок();
КонецПроцедуры

Функция ПеревестиИз10(Знач Значение = 0) Экспорт
	Значение = Число(Значение);
	Если Значение <= 0 Тогда
		Возврат "00";
	КонецЕсли;
	
	Значение = Цел(Значение);
	Результат = "";
	
	Пока Значение > 0 Цикл
		Результат = Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Значение%16+1,1) + Результат;
		Значение = Цел(Значение/16);
	КонецЦикла;
	
	Если СтрДлина(Результат) = 1 Тогда
		Результат = "0" + Результат;
	КонецЕсли; 
  
	Возврат Результат;
КонецФункции

Процедура ПолеHTMLДокументаДокументСформирован(Элемент)
	Документ.Body.ContentEditable = "true";
КонецПроцедуры

Процедура КоманднаяПанельРисунок(Кнопка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл с рисунком";
	Диалог.Фильтр = "Файлы рисунков|*.gif;*.dib;*.jpg;*.jpeg;*.bmp;*.ico;*.emf;*.wmf;*.tga;*.tif;*.tiff;*.rle;*.iff;*.lbm;*.ilbm;*.jpe;*.jif;*.jfif;*.kdc;*.pcd;*.pcx;*.dcx;*.pic;*.pix;*.png;*.psd;*.sgi;*.bw;*.rgb;*.rgba|Все файлы|*.*";
    Диалог.ПредварительныйПросмотр = Истина;
	
	Если Диалог.Выбрать() Тогда
		Документ.execCommand("InsertImage", Ложь, Диалог.ПолноеИмяФайла);
	КонецЕсли;
	ПоказатьРежимыКнопок();
КонецПроцедуры

Процедура КоманднаяПанельГиперссылка(Кнопка)
	Гиперссылка = ЭтотОбъект.ПолучитьФорму("ВыборГиперссылки").ОткрытьМодально();
	Если Гиперссылка <> Неопределено Тогда
		Документ.execCommand("CreateLink", Ложь, Гиперссылка);
	КонецЕсли;
	ПоказатьРежимыКнопок();
КонецПроцедуры

Процедура ПоказатьРежимыКнопок()
	Для каждого Кнопка Из ЭлементыФормы.КоманднаяПанель.Кнопки Цикл
		Если Кнопка.ТипКнопки =  ТипКнопкиКоманднойПанели.Действие Тогда
			Команда = Сред(Кнопка.Имя, 8);
			Если Документ.queryCommandSupported(Команда) Тогда
				Попытка
					Кнопка.Пометка = Документ.queryCommandState(Команда);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

Процедура ПолеHTMLДокументаonclick(Элемент, pEvtObj)
	ПоказатьРежимыКнопок();
КонецПроцедуры

Процедура ПриЗакрытии()
	Для д=0 по КоллекцияВременныхФайлов.Количество()-1 цикл
		УдалитьФайлы(КоллекцияВременныхФайлов[д].ПолноеИмя);
	КонецЦикла;
	  КоллекцияВременныхФайлов.Очистить();
КонецПроцедуры
